# MINI-PROJECT 1

## Read the data

In [1]:
import pandas as pd
df=pd.read_excel(r"C:\Users\chait\OneDrive\Desktop\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

# Exploring the data

In [2]:
df.head()

        Date      City  Temperature_C  Humidity_% Condition
0 2025-01-01  Hyderbad             28          60     Sunny
1 2025-01-02  Hyderbad             29          62     Sunny
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [3]:
df.head(10)

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [4]:
df.tail()

        Date        City  Temperature_C  Humidity_% Condition
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [5]:
df.tail(7)

        Date        City  Temperature_C  Humidity_% Condition
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     datetime64[ns]
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 532.0+ bytes

In [7]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [9]:
df.dtypes

Date             datetime64[ns]
City                     object
Temperature_C             int64
Humidity_%                int64
Condition                object
dtype: object

In [10]:
df.Date

0   2025-01-01
1   2025-01-02
2   2025-01-03
3   2025-01-04
4   2025-01-05
5   2025-01-06
6   2025-01-07
7   2025-01-08
8   2025-01-09
9   2025-01-10
Name: Date, dtype: datetime64[ns]

In [11]:
df.City

0      Hyderbad
1      Hyderbad
2      Hyderbad
3      Hyderbad
4      Banglore
5      Banglore
6      Banglore
7      Banglore
8    Vijayawada
9    Vijayawada
Name: City, dtype: object

In [12]:
df.shape

(10, 5)

In [13]:
df[2:5]

        Date      City  Temperature_C  Humidity_% Condition
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [14]:
df[['Date','Condition']]

        Date Condition
0 2025-01-01     Sunny
1 2025-01-02     Sunny
2 2025-01-03    Cloudy
3 2025-01-04    Cloudy
4 2025-01-05     Rainy
5 2025-01-06     Rainy
6 2025-01-07     Sunny
7 2025-01-08    Cloudy
8 2025-01-09     Rainy
9 2025-01-10     Sunny

In [15]:
Data={
    'Name':['chaitanya','Tulasi','Sravanthi','Anitha','Hannah','Aruna','Manasa','Moina'],
    'Age':[20,20,19,21,19,20,21,19],
    'Branch':['BCA','BSC','BBA','B.COM','BCA','B.COM','BBA','BCA'],
    'Location':['kkd','akp','vzg','kkd','vzg','hyd','kkd','vjy']
}
df=pd.DataFrame(Data)
df

        Name  Age Branch Location
0  chaitanya   20    BCA      kkd
1     Tulasi   20    BSC      akp
2  Sravanthi   19    BBA      vzg
3     Anitha   21  B.COM      kkd
4     Hannah   19    BCA      vzg
5      Aruna   20  B.COM      hyd
6     Manasa   21    BBA      kkd
7      Moina   19    BCS      vjy

In [16]:
df.head()

        Name  Age Branch Location
0  chaitanya   20    BCA      kkd
1     Tulasi   20    BSC      akp
2  Sravanthi   19    BBA      vzg
3     Anitha   21  B.COM      kkd
4     Hannah   19    BCA      vzg

In [18]:
df.head(6)

        Name  Age Branch Location
0  chaitanya   20    BCA      kkd
1     Tulasi   20    BSC      akp
2  Sravanthi   19    BBA      vzg
3     Anitha   21  B.COM      kkd
4     Hannah   19    BCA      vzg
5      Aruna   20  B.COM      hyd

In [19]:
df.tail()

     Name  Age Branch Location
3  Anitha   21  B.COM      kkd
4  Hannah   19    BCA      vzg
5   Aruna   20  B.COM      hyd
6  Manasa   21    BBA      kkd
7   Moina   19    BCS      vjy

In [21]:
df.tail(4)

     Name  Age Branch Location
4  Hannah   19    BCA      vzg
5   Aruna   20  B.COM      hyd
6  Manasa   21    BBA      kkd
7   Moina   19    BCS      vjy

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      8 non-null      object
 1   Age       8 non-null      int64
 2   Branch    8 non-null      object
 3   Location  8 non-null      object
dtypes: int64(1), object(3)
memory usage: 388.0+ bytes

In [23]:
df.columns

Index(['Name', 'Age', 'Branch', 'Location'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [25]:
df.dtypes

Name        object
Age          int64
Branch      object
Location    object
dtype: object

In [26]:
df.Name

0    chaitanya
1       Tulasi
2    Sravanthi
3       Anitha
4       Hannah
5        Aruna
6       Manasa
7        Moina
Name: Name, dtype: object

In [27]:
df.Location

0    kkd
1    akp
2    vzg
3    kkd
4    vzg
5    hyd
6    kkd
7    vjy
Name: Location, dtype: object

In [28]:
df.columns

Index(['Name', 'Age', 'Branch', 'Location'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [30]:
df.dtypes

Name        object
Age          int64
Branch      object
Location    object
dtype: object

In [31]:
df.Name

0    chaitanya
1       Tulasi
2    Sravanthi
3       Anitha
4       Hannah
5        Aruna
6       Manasa
7        Moina
Name: Name, dtype: object

In [32]:
df.shape

(8, 4)

In [33]:
df[2:5]

        Name  Age Branch Location
2  Sravanthi   19    BBA      vzg
3     Anitha   21  B.COM      kkd
4     Hannah   19    BCA      vzg

In [34]:
df[['Name','Age']]

        Name  Age
0  chaitanya   20
1     Tulasi   20
2  Sravanthi   19
3     Anitha   21
4     Hannah   19
5      Aruna   20
6     Manasa   21
7      Moina   19

In [36]:
df[['Name','Location','Branch']]

        Name Location Branch
0  chaitanya      kkd    BCA
1     Tulasi      akp    BSC
2  Sravanthi      vzg    BBA
3     Anitha      kkd  B.COM
4     Hannah      vzg    BCA
5      Aruna      hyd  B.COM
6     Manasa      kkd    BBA
7      Moina      vjy    BCS